JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
#include "stm32_assert.h"
#include "stm32_cpu_delay.h"
#include "usbd_core.h"
#include "usbd_request.h"
#include "usbd_hw.h"

#if USBD_CORE_EVENT_DRIVEN == 1
enum usbd_event
{
	NONE = 0,
	RESET,
	CTR,
	SETUP,
	SUSPEND,
	WAKEUP,
	PMAOVR,
	SOF,
	ESOF,
	LPM_L1,
	ERROR
};
#define USBD_MAX_EVENT 11
#endif

/************************************************
 * USB requests callbacks.
 * These callbacks vary per state.
 ***********************************************/
struct usbd_requests
{
	void (*get_status)(usbd_setup_packet_type setup);
	void (*clear_feature)(usbd_setup_packet_type setup);
	void (*set_feature)(usbd_setup_packet_type setup);
	void (*set_address)(usbd_setup_packet_type setup);
	void (*get_descriptor)(usbd_setup_packet_type setup);
	void (*set_descriptor)(usbd_setup_packet_type setup);
	void (*get_configuration)(usbd_setup_packet_type setup);
	void (*set_configuration)(usbd_setup_packet_type setup);
	void (*get_interface)(usbd_setup_packet_type setup);
	void (*set_interface)(usbd_setup_packet_type setup);
	void (*synch_frame)(usbd_setup_packet_type setup);
	void (*class_request)(usbd_setup_packet_type setup);
	void (*vendor_request)(usbd_setup_packet_type setup);
};

/************************************************
 * Static variables and callbacks 
 * used by the usb core.
 ***********************************************/
static uint8_t *ep0_buf; /*!< Pointer to endpoint 0 buffer.*/
static uint32_t ep0_cnt; /*!< endpoint 0 buffer data count.*/
static void (*stage)(void); /*!< Pointer to current stage callback.*/
static void (*reception_completed)(void); /*!< Stores a callback function, used to let the user know that a data reception in endpoint 0 has been completed. (Useful for class and/or vendor requests)*/
static struct usbd_requests const *cur_state; /*!< Pointer to current state of the device.*/
static struct usbd_requests const *prev_state; /*!< Pointer to previous state of the device.(Used to store the state when the device gets suspended)*/
static uint16_t device_address; /*!< Stores the device address.*/
static usbd_core_config_type *config; /*!< Pointer to the configuration provided by the user during initialization.*/
static void (*ep_handler[8][2])(void); /*!< Pointer to stored endpoint callback functions.*/
#if USBD_CORE_EVENT_DRIVEN == 1
static void (*cur_ep_handler)(void);

static struct usbd_queue
{
	enum usbd_event buffer[USBD_MAX_EVENT + 1];
	uint32_t head;
	uint32_t tail;
}queue;

#define USBD_QUEUE_NEXT_HEAD() ((queue.head + 1 == USBD_MAX_EVENT) ? 0 : (queue.head + 1))
#define USBD_QUEUE_NEXT_TAIL() ((queue.tail + 1 == USBD_MAX_EVENT) ? 0 : (queue.tail + 1))
#define USBD_QUEUE_IS_EMPTY() ((queue.head == queue.tail) ? 1 : 0)
#define USBD_QUEUE_IS_FULL() ((USBD_QUEUE_NEXT_HEAD() == queue.tail) ? 1 : 0)
#endif

/************************************************
 * Function prototypes.
 ***********************************************/
static void usbd_ep0_handler(void);
static void usbd_setup_stage(void);
static void usbd_data_out_stage(void);
static void usbd_data_in_stage(void);
static void usbd_status_in_stage(void);
static void usbd_status_out_stage(void);

static void usbd_parse_setup_packet(usbd_setup_packet_type setup);

static void usbd_get_status(usbd_setup_packet_type setup);
static void usbd_clear_feature(usbd_setup_packet_type setup);
static void usbd_set_feature(usbd_setup_packet_type setup);
static void usbd_set_address(usbd_setup_packet_type setup);
static void usbd_get_descriptor(usbd_setup_packet_type setup);
static void usbd_set_descriptor(usbd_setup_packet_type setup);
static void usbd_get_configuration(usbd_setup_packet_type setup);
static void usbd_set_configuration(usbd_setup_packet_type setup);
static void usbd_get_interface(usbd_setup_packet_type setup);
static void usbd_set_interface(usbd_setup_packet_type setup);
static void usbd_synch_frame(usbd_setup_packet_type setup);
static void usbd_class_request(usbd_setup_packet_type setup);
static void usbd_vendor_request(usbd_setup_packet_type setup);

static void usbd_reset(void);

#if USBD_CORE_EVENT_DRIVEN == 1
static void usbd_event_enqueue(enum usbd_event e);
static enum usbd_event usbd_event_dequeue(void);
static void usbd_event_generator(void);
static void usbd_device_event_handler(enum usbd_event e);
#else
static void usbd_irq_handler(void);
#endif

/************************************************
 * Request callbacks for default state.
 ***********************************************/
static const struct usbd_requests default_state =
{
	NULL,
	NULL,
	NULL,
	usbd_set_address,
	usbd_get_descriptor,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL,
	NULL
};

/************************************************
 * Request callbacks for address state.
 ***********************************************/
static const struct usbd_requests addressed_state =
{
	usbd_get_status,
	usbd_clear_feature,
	usbd_set_feature,
	usbd_set_address,
	usbd_get_descriptor,
	NULL,
	usbd_get_configuration,
	usbd_set_configuration,
	NULL,
	NULL,
	NULL,
	NULL,
	usbd_vendor_request
};

/************************************************
 * Request callbacks for configured state.
 ***********************************************/
static const struct usbd_requests configured_state =
{
	usbd_get_status,
	usbd_clear_feature,
	usbd_set_feature,
	NULL,
	usbd_get_descriptor,
	usbd_set_descriptor,
	usbd_get_configuration,
	usbd_set_configuration,
	usbd_get_interface,
	usbd_set_interface,
	usbd_synch_frame,
	usbd_class_request,
	usbd_vendor_request
};

/************************************************
 * Request callbacks for suspended state.
 ***********************************************/
static const struct usbd_requests suspended_state;

/**
 * @brief Endpoint 0 callback function.
 * @param  
 */
static void usbd_ep0_handler(void)
{
	ASSERT(stage != NULL);
	stage();
}

/**
 * @brief Setup stage callback function.
 * @param  
 */
static void usbd_setup_stage(void)
{
	usbd_setup_packet_type setup = {0};
	uint16_t count = USBD_PMA_GET_RX_COUNT(EP0);
	
