JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
	if(count != USBD_SETUP_PACKET_SIZE)
	{
		USBD_EP0_SET_STALL();
	}

	usbd_pma_read(ADDR0_RX, (uint8_t*)&setup, count);
	usbd_parse_setup_packet(setup);
}

/**
 * @brief Data stage callback function, for IN direction.
 * @param  
 */
static void usbd_data_in_stage(void)
{
	uint32_t cnt = MIN(EP0_COUNT, ep0_cnt);
	/*Decrement the leftover bytes.*/
	ep0_cnt -= cnt;

	/*If there is no leftover data, Data In stage is completed.*/
	if (!ep0_cnt)
	{
		USBD_EP_SET_KIND(EP0);
		stage = usbd_status_out_stage;
		USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
		return;
	}
	/*If it's a short packet the opposite direction is set to NAK.*/
	if (ep0_cnt < EP0_COUNT)
	{
		USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_NAK);
	}
	/*Increment the buffer.*/
	ep0_buf += cnt;
	/*Copy a packet to usb sram*/
	USBD_PMA_SET_TX_COUNT(EP0, MIN(EP0_COUNT, ep0_cnt));
	usbd_pma_write(ep0_buf, ADDR0_TX, MIN(EP0_COUNT, ep0_cnt));
	USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_VALID);
}

/**
 * @brief Data stage callback function for OUT direction.
 * @param  
 */
static void usbd_data_out_stage(void)
{
	/*Get the rx count and protect from underflow.*/
	uint32_t cnt = MIN(USBD_PMA_GET_RX_COUNT(EP0), ep0_cnt);
	usbd_pma_read(ADDR0_RX, ep0_buf, cnt);
	/*Decrement the leftover bytes.*/
	ep0_cnt -= cnt;

	if (ep0_cnt < EP0_COUNT)
	{
		USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_NAK);
	}
	/*If there is leftover data, increment the buffer pointer.*/
	if (ep0_cnt)
	{
		ep0_buf += cnt;
		USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
	}
	/*Otherwise the stage is completed.*/
	else
	{
		stage = usbd_status_in_stage;
		USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_VALID);
	}
}

/**
 * @brief Status stage callback function for IN direction.
 * @param  
 */
static void usbd_status_in_stage(void)
{
	if (device_address && cur_state == &default_state)
	{
		cur_state = &addressed_state;
		/*Set the device address.*/
		SET(USB->DADDR, device_address);
	}

	if (!device_address && cur_state == &addressed_state)
	{
		cur_state = &default_state;
		/*Clear the device address*/
		CLEAR(USB->DADDR, USB_DADDR_ADD);
	}

	if(reception_completed != NULL)
	{
		reception_completed();
	}
	/*Clear the ep0 transfer.*/
	ep0_buf = NULL;
	ep0_cnt = 0;
	stage = NULL;
	USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
}

/**
 * @brief Status stage callback function for OUT direction.
 * @param  
 */
static void usbd_status_out_stage(void)
{
	/*Clear hardware status out*/
	USBD_EP_CLEAR_KIND(EP0);
	/*Clear the ep0 transfer.*/
	ep0_buf = NULL;
	ep0_cnt = 0;
	stage = NULL;
	USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
}

/**
 * @brief Parses the received setup packet and calls 
 * the appropriate callback function depending on 
 * the current device state.
 * @param setup USB setup packet.
 */
static void usbd_parse_setup_packet(usbd_setup_packet_type setup)
{
    switch(setup.bmRequestType & USBD_TYPE)
    {
        case USBD_TYPE_STANDARD:
        {
            switch(setup.bRequest)
            {
                case USBD_GET_STATUS:
                {
					if(cur_state->get_status == NULL)
					{						
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->get_status(setup);
                    break;
                }
                case USBD_CLEAR_FEATURE:
                {
					if(cur_state->clear_feature == NULL)
					{					
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->clear_feature(setup);
                    break;
                }
                case USBD_SET_FEATURE:
                {
					if(cur_state->set_feature == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->set_feature(setup);
                    break;            
                }
                case USBD_SET_ADDRESS:
                {
					if(cur_state->set_address == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->set_address(setup);
                    break;            
                }
                case USBD_GET_DESCRIPTOR:
                {
					if(cur_state->get_descriptor == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->get_descriptor(setup);
                    break;            
                }
                case USBD_SET_DESCRIPTOR:
                {
					if(cur_state->set_descriptor == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->set_descriptor(setup);
                    break;            
                }
                case USBD_GET_CONFIGURATION:
                {
					if(cur_state->get_configuration == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->get_configuration(setup);
                    break;
                }
                case USBD_SET_CONFIGURATION:
                {
					if(cur_state->set_configuration == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
					cur_state->set_configuration(setup);
                    break;            
                }
                case USBD_GET_INTERFACE:
                {
					if(cur_state->get_interface == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->get_interface(setup);
                    break;
                }
                case USBD_SET_INTERFACE:
                {
					if(cur_state->set_interface == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->set_interface(setup);
                    break;
                }
                case USBD_SYNCH_FRAME:
                {
					if(cur_state->synch_frame == NULL)
					{
						USBD_EP0_SET_STALL();
						return;
					}
                    cur_state->synch_frame(setup);
                    break;
                }
                default:
                {
					USBD_EP0_SET_STALL();
                    break;
                }
            }
            break;
        }
        case USBD_TYPE_CLASS:
        {
			if(cur_state->class_request == NULL)
			{
				USBD_EP0_SET_STALL();
				return;
			}
            cur_state->class_request(setup);
            break;
        }
        case USBD_TYPE_VENDOR:
        {
			if(cur_state->vendor_request == NULL)
			{
				USBD_EP0_SET_STALL();
				return;
			}
			cur_state->vendor_request(setup);
            break;
        }
        default:
        {
			USBD_EP0_SET_STALL();
        }
    }
}

/**
 * @brief USB get status callback function.
 * @param setup USB setup packet.
 */
static void usbd_get_status(usbd_setup_packet_type setup)
{
	uint8_t buf[2] = { 0x0U, 0x0U };

