JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
	switch (setup.bmRequestType & USBD_RECIPIENT)
	{
		case USBD_RECIPIENT_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->get_remote_wakeup != NULL);
			ASSERT(config->is_selfpowered != NULL);
			buf[0] = config->get_remote_wakeup() ? 1 << 1 : 0 << 1;
			buf[0] |= config->is_selfpowered() ? 1 : 0;
			break;
		}
		case USBD_RECIPIENT_INTERFACE:
		{
			ASSERT(config != NULL);
			ASSERT(config->is_interface_valid != NULL);
			if(!config->is_interface_valid(setup.wIndex & 0x7FU))
			{
				USBD_EP0_SET_STALL();
				return;
			}
			break;
		}
		case USBD_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & USBD_EP_ADDRESS_EP_NUMBER);
			uint8_t dir =  (setup.wIndex & USBD_EP_ADDRESS_EP_DIRECTION) ? 1 : 0;
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_EP0_SET_STALL();
				return;
			}
			buf[0] = (uint8_t) USBD_EP_GET_STALL(ep, dir) ? 1: 0;
			break;

		}
		default:
		{
			USBD_EP0_SET_STALL();
			return;
			break;			
		}
	}
	usbd_prepare_data_in_stage(buf, USBD_GET_STATUS_LENGTH);
}

/**
 * @brief USB clear feature callback function.
 * @param setup USB setup packet.
 */
static void usbd_clear_feature(usbd_setup_packet_type setup)
{
	switch (setup.bmRequestType & USBD_RECIPIENT)
	{
		case USBD_RECIPIENT_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->set_remote_wakeup != NULL);
			config->set_remote_wakeup(false);
			break;	
		}
		case USBD_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & USBD_EP_ADDRESS_EP_NUMBER);
			uint8_t dir =  (setup.wIndex & USBD_EP_ADDRESS_EP_DIRECTION) ? 1 : 0;
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_EP0_SET_STALL();
				return;
			}
			ASSERT(config->clear_stall != NULL);
			config->clear_stall(ep, dir);
			break;
		}
		default:
		{
			USBD_EP0_SET_STALL();
			return;
			break;			
		}
	}
	usbd_prepare_status_in_stage();
}

/**
 * @brief USB set feature callback function.
 * @param setup USB setup packet.
 */
static void usbd_set_feature(usbd_setup_packet_type setup)
{
	switch (setup.bmRequestType & USBD_RECIPIENT)
	{
		case USBD_RECIPIENT_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->set_remote_wakeup != NULL);
			config->set_remote_wakeup(true);
			break;	
		}
		case USBD_RECIPIENT_ENDPOINT:
		{
			uint8_t ep = (setup.wIndex & USBD_EP_ADDRESS_EP_NUMBER);
			uint8_t dir =  (setup.wIndex & USBD_EP_ADDRESS_EP_DIRECTION) ? 1 : 0;
			ASSERT(config != NULL);
			ASSERT(config->is_endpoint_valid != NULL);
			if(!config->is_endpoint_valid(ep, dir))
			{
				USBD_EP0_SET_STALL();
				return;
			}
			if (dir)
			{
				USBD_EP_SET_TX_STALL(ep);
			}
			else
			{
				USBD_EP_SET_RX_STALL(ep);
			}
			break;
		}
		default:
		{
			USBD_EP0_SET_STALL();
			return;
			break;			
		}
	}
	usbd_prepare_status_in_stage();
}

/**
 * @brief USB set address callback function.
 * @param setup USB setup packet.
 */
static void usbd_set_address(usbd_setup_packet_type setup)
{
	device_address = setup.wValue;
	usbd_prepare_status_in_stage();
}

/**
 * @brief USB get descriptor callback function.
 * @param setup USB setup packet.
 */
static void usbd_get_descriptor(usbd_setup_packet_type setup)
{
	uint8_t *buf = NULL;
	uint32_t cnt = 0;

	switch ((((setup.wValue) >> 0x8U) & 0xFFU))
	{
		case USBD_DESC_TYPE_DEVICE:
		{
			ASSERT(config != NULL);
			ASSERT(config->device_descriptor != NULL);
			buf = config->device_descriptor();
			cnt = MIN(setup.wLength, buf[0]);
			break;
		}
		case USBD_DESC_TYPE_CONFIGURATION:
		{
			ASSERT(config != NULL);
			ASSERT(config->configuration_descriptor != NULL);
			buf = config->configuration_descriptor(setup.wValue & 0xFFU);
			cnt = MIN(setup.wLength, (buf[2] | buf[3] << 8));
			break;
		}
		case USBD_DESC_TYPE_STRING:
		{
			ASSERT(config != NULL);
			ASSERT(config->string_descriptor != NULL);
			buf = config->string_descriptor((setup.wValue & 0xFFU), setup.wIndex);
			cnt = MIN(setup.wLength, buf[0]);
			break;
		}		
		case USBD_DESC_TYPE_BOS:
		{
			ASSERT(config != NULL);
			ASSERT(config->bos_descriptor != NULL);
			buf = config->bos_descriptor();
			cnt = setup.wLength;
			break;
		}
		default:
		{
			USBD_EP0_SET_STALL();
			return;
			break;
		}
	}
	usbd_prepare_data_in_stage(buf, cnt);
}

/**
 * @brief USB set descriptor callback function.
 * @param setup USB setup packet.
 */
static void usbd_set_descriptor(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->set_descriptor != NULL);
	config->set_descriptor(setup);
}

/**
 * @brief USB get descriptor callback function.
 * @param setup USB setup packet.
 */
static void usbd_get_configuration(usbd_setup_packet_type setup)
{
	UNUSED(setup);
	uint8_t buf = 0;
	ASSERT(config != NULL);
	ASSERT(config->get_configuration != NULL);
	buf = config->get_configuration();
	usbd_prepare_data_in_stage(&buf, USBD_GET_CONFIGURATION_LENGTH);
}

/**
 * @brief USB set configuration callback function.
 * @param setup USB setup packet.
 */
static void usbd_set_configuration(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wValue & 0xFFU);
	ASSERT(config != NULL);
	ASSERT(config->is_configuration_valid != NULL);
	if(!config->is_configuration_valid(num))
	{
		USBD_EP0_SET_STALL();
		return;
	}
	ASSERT(config->set_configuration != NULL);
	config->set_configuration(num);
	cur_state = num ? &configured_state : &addressed_state;
	usbd_prepare_status_in_stage();
}

/**
 * @brief USB get interface callback function.
 * @param setup USB setup packet.
 */
static void usbd_get_interface(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wIndex & 0x7FU);
	uint8_t buf = 0;
	ASSERT(config != NULL);
	ASSERT(config->is_interface_valid != NULL);
	if(!config->is_interface_valid(num))
	{
		USBD_EP0_SET_STALL();
		return;
	}
	ASSERT(config->get_interface != NULL);
	buf = config->get_interface(num);
	usbd_prepare_data_in_stage(&buf, USBD_GET_INTERFACE_LENGTH);
}

/**
 * @brief USB set interface callback function.
 * @param setup USB setup packet.
 */
static void usbd_set_interface(usbd_setup_packet_type setup)
{
	uint8_t num = (setup.wIndex & 0x7FU);
	uint8_t alt = (setup.wValue & 0xFFU);
	ASSERT(config != NULL);
	ASSERT(config->is_interface_valid != NULL);
	if (!config->is_interface_valid(num))
	{
		USBD_EP0_SET_STALL();		
	}
	ASSERT(config->set_interface != NULL);
	config->set_interface(num, alt);
	usbd_prepare_status_in_stage();	
}

/**
 * @brief USB synch frame callback function.
 * @param setup USB setup packet.
 */
static void usbd_synch_frame(usbd_setup_packet_type setup)
{
	UNUSED(setup);
	/*@todo*/
	//uint8_t ep = (setup.wIndex & 0xFF);
	//uint8_t buf[2];
	/*@todo check if endpoint iso*/
	/*@todo get frame number*/
	//usbd_prepare_data_in_stage(buf, USBD_SYNCH_FRAME_LENGTH);
}

/**
 * @brief USB class specific request callback function.
 * @param setup USB setup packet.
 */
static void usbd_class_request(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->class_request != NULL);
	config->class_request(setup);
}

/**
 * @brief USB vendor specific request callback function.
 * @param setup USB setup packet.
 */
static void usbd_vendor_request(usbd_setup_packet_type setup)
{
	ASSERT(config != NULL);
	ASSERT(config->vendor_request != NULL);
	config->vendor_request(setup);
}

/**
 * @brief Resets the usb device.
 * @param  
 */
static void usbd_reset(void)
{
	for (uint8_t i = 0; i < 8; i++)
	{
		usbd_unregister_ep(i);
	}
	usbd_register_ep(EP0, USB_EP_TYPE_CONTROL, ADDR0_TX_OFFSET, ADDR0_RX_OFFSET, EP0_COUNT, usbd_ep0_handler, usbd_ep0_handler);
	ep0_buf = NULL;
	ep0_cnt = 0;
	cur_state = &default_state;
	USB->DADDR = USB_DADDR_EF;
}

#if USBD_CORE_EVENT_DRIVEN == 1
static void usbd_event_enqueue(enum usbd_event e)
{
	ASSERT(!USBD_QUEUE_IS_FULL());
	queue.buffer[queue.head] = e;
	queue.head = USBD_QUEUE_NEXT_HEAD();
}

