JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
static enum usbd_event usbd_event_dequeue(void)
{
	enum usbd_event e = NONE;
	if (!USBD_QUEUE_IS_EMPTY())
	{
		e = queue.buffer[queue.tail];
		queue.tail = USBD_QUEUE_NEXT_TAIL();
	}
	return e;
}

static void usbd_event_generator(void)
{
	enum usbd_event e = NONE;
	uint32_t istr = USB->ISTR;

	if (GET(istr, USB_ISTR_CTR))
	{
		uint8_t ep = GET(istr, USB_EP_EA);
		uint8_t dir = GET(*USBD_EP_REG(ep), USB_EP_CTR_TX) ? 1 : 0;
		ASSERT(ep_handler[ep][dir] != NULL);
		if (dir)
		{
			USBD_EP_CLEAR_CTR_TX(ep);
		}
		else
		{
			USBD_EP_CLEAR_CTR_RX(ep);
		}

		cur_ep_handler = ep_handler[ep][dir];

		e = CTR;
		if (USBD_EP_GET_SETUP(ep))
		{
			e = SETUP;
		}

	}
	else if (GET(istr, USB_ISTR_RESET))
	{
		CLEAR(istr, USB_ISTR_RESET);
		e = RESET;
	}
	else if (GET(istr, USB_ISTR_WKUP))
	{
		CLEAR(istr, USB_ISTR_WKUP);
		e = WAKEUP;
	}
	else if (GET(istr, USB_ISTR_SUSP))
	{
		CLEAR(istr, USB_ISTR_SUSP);
		e = SUSPEND;
	}
	else if (GET(istr, USB_ISTR_SOF))
	{
		CLEAR(istr, USB_ISTR_SOF);
		e = SOF;
	}

	usbd_event_enqueue(e);
	USB->ISTR = istr;
}

static void usbd_device_event_handler(enum usbd_event e)
{
	switch (e)
	{
		case RESET:
		{
			usbd_reset();
			break;
		}
		case SETUP:
		{
			/*Set setup stage.*/
			stage = usbd_setup_stage;
			/*fallthrough*/
			__attribute__((fallthrough));
		}
		case CTR:
		{
			ASSERT(cur_ep_handler != NULL);
			cur_ep_handler();
			break;
		}
		case SUSPEND:
		{
			/*Store the cur_state state.*/
			prev_state = cur_state;
			cur_state = &suspended_state;
			if (config->suspend != NULL)
			{
				config->suspend();
			}
			break;
		}
		case WAKEUP:
		{

			/*Line noise detection*/
			if (GET(USB->FNR, USB_FNR_RXDP))
			{
				SET(USB->CNTR, USB_CNTR_LPMODE);
				if (config->suspend != NULL)
				{
					config->suspend();
				}
				return;
			}
			/*Restore the cur_state state.*/
			cur_state = prev_state;
			prev_state = NULL;
			CLEAR(USB->CNTR, USB_CNTR_FSUSP);
			if (config->wakeup != NULL)
			{
				config->wakeup();
			}
			break;
		}
		case SOF:
		{
			if (config->sof != NULL)
			{
				config->sof();
			}
		}
		case NONE:
		{
			/*Do nothing.*/
			break;
		}
		default:
		{
			USBD_EP0_SET_STALL();
			break;
		}		
	}
}
#else

/**
 * @brief Handle the usb interrupts.
 * @note This function should be called by USB_IRQHandler interrupt callback.
 * @param  
 */
static void usbd_irq_handler(void)
{
	uint32_t istr = USB->ISTR;

	if (GET(istr, USB_ISTR_CTR))
	{
		uint8_t ep = GET(istr, USB_EP_EA);
		uint8_t dir = GET(*USBD_EP_REG(ep), USB_EP_CTR_TX) ? 1 : 0;
		if (dir)
		{
			USBD_EP_CLEAR_CTR_TX(ep);
		}
		else
		{
			USBD_EP_CLEAR_CTR_RX(ep);
		}

		if (USBD_EP_GET_SETUP(ep))
		{
			stage = usbd_setup_stage;
		}
		ASSERT(ep_handler[ep][dir] != NULL);
		ep_handler[ep][dir]();
	}

	if (GET(istr, USB_ISTR_RESET))
	{
		CLEAR(istr, USB_ISTR_RESET);
		usbd_reset();
	}

	if (GET(istr, USB_ISTR_WKUP))
	{
		CLEAR(istr, USB_ISTR_WKUP);
		/*Line noise detection*/
		if (GET(USB->FNR, USB_FNR_RXDP))
		{
			SET(USB->CNTR, USB_CNTR_LPMODE);
			return;
		}
		CLEAR(USB->CNTR, USB_CNTR_FSUSP);
		cur_state = prev_state;
		prev_state = NULL;
		if (config->wakeup != NULL)
		{
			config->wakeup();
		}
	}

	if (GET(istr, USB_ISTR_SUSP))
	{
		CLEAR(istr, USB_ISTR_SUSP);
		prev_state = cur_state;
		cur_state = &suspended_state;
		SET(USB->CNTR, USB_CNTR_FSUSP);
		SET(USB->CNTR, USB_CNTR_LPMODE);
		if (config->suspend != NULL)
		{
			config->suspend();
		}	

	}	

	if (GET(istr, USB_ISTR_SOF))
	{
		CLEAR(istr, USB_ISTR_SOF);
		if (config->sof != NULL)
		{
			config->sof();
		}
	}

	USB->ISTR = istr;
}
#endif

/**
 * @brief Initialize a single buffer bidirectional endpoint.
 * @param ep Endpoint number.
 * @param type Endpoint type.
 * @param tx_addr The address offset of the endpoint's IN buffer inside the Packet Memory Area.
 * @param rx_addr The address offset of the endpoint's OUT buffer inside the Packet Memory Area.
 * @param rx_count The size of the endpoint's OUT buffer inside the Packet Memory Area.
 * @param ep_in Pointer to callback function that handles the IN transaction of the endpoint.
 * @param ep_out Pointer to callback function that handles the OUT transaction of the endpoint.
*/
void usbd_register_ep(uint8_t ep, uint32_t type, uint16_t tx_addr, uint16_t rx_addr, uint16_t rx_count, void (*ep_in)(void), void (*ep_out)(void))
{
	ASSERT(ep < 8);
	ASSERT((type == USB_EP_TYPE_BULK) || (type == USB_EP_TYPE_CONTROL) || (type == USB_EP_TYPE_INTERRUPT));
	ASSERT((tx_addr < PMA_SIZE) && (rx_addr < PMA_SIZE) && (rx_count < USBD_PMA_COUNT));
	ASSERT(ep_in != NULL);
	ASSERT(ep_out != NULL);
	ep_handler[ep][1] = ep_in;
	ep_handler[ep][0] = ep_out;
	USBD_EP_SET_CONF(ep, type, tx_addr, rx_addr, rx_count);
}

/**
 * @brief Initialize a single buffer unidirectional IN endpoint.
 * @param ep Endpoint number.
 * @param type Endpoint type.
 * @param tx_addr The address offset of the endpoint's IN buffer inside the Packet Memory Area.
 * @param ep_in Pointer to callback function that handles the IN transaction of the endpoint.
 */
void usbd_register_ep_tx(uint8_t ep, uint32_t type, uint32_t tx_addr, void (*ep_in)(void))
{
	ASSERT(ep < 8);
	ASSERT((type == USB_EP_TYPE_BULK) || (type == USB_EP_TYPE_CONTROL) || (type == USB_EP_TYPE_INTERRUPT));
	ASSERT(tx_addr < PMA_SIZE);
	ASSERT(ep_in != NULL);
	ep_handler[ep][1] = ep_in;
	USBD_EP_SET_CONF(ep, type, tx_addr, 0, 0);
}

/**
 * @brief Initialize a single buffer unidirectional OUT endpoint.
 * @param ep Endpoint number.
 * @param type Endpoint type.
 * @param rx_addr The address offset of the endpoint's OUT buffer inside the Packet Memory Area.
 * @param rx_count The size of the endpoint's OUT buffer inside the Packet Memory Area.
 * @param ep_out Pointer to callback function that handles the OUT transaction of the endpoint.
 */
void usbd_register_ep_rx(uint8_t ep, uint32_t type, uint32_t rx_addr, uint32_t rx_count, void (*ep_out)(void))
{
	ASSERT(ep < 8);
	ASSERT((type == USB_EP_TYPE_BULK) || (type == USB_EP_TYPE_CONTROL) || (type == USB_EP_TYPE_INTERRUPT));
	ASSERT((rx_addr < PMA_SIZE) && (rx_count < USBD_PMA_COUNT));
	ASSERT(ep_out != NULL);
	ep_handler[ep][0] = ep_out;
	USBD_EP_SET_CONF(ep, type, 0, rx_addr, rx_count);
}

/**
 * @brief Initialize a double buffer unidirectional IN endpoint.
 * @param ep Endpoint number.
 * @param type Endpoint type.
 * @param tx0_addr The address offset of the endpoint's IN 0 buffer inside the Packet Memory Area.
 * @param tx1_addr The address offset of the endpoint's IN 1 buffer inside the Packet Memory Area.
 * @param ep_in Pointer to callback function that handles the IN transaction of the endpoint.
 */
void usbd_register_ep_dbl_tx(uint8_t ep, uint32_t type, uint32_t tx0_addr, uint32_t tx1_addr, void (*ep_in)(void))
{
	ASSERT(ep < 8);
	ASSERT((type == USB_EP_TYPE_BULK) || (type == USB_EP_TYPE_ISOCHRONOUS));
	ASSERT((tx0_addr < PMA_SIZE) && (tx1_addr < PMA_SIZE));
	ASSERT(ep_in != NULL);
	ep_handler[ep][1] = ep_in;
	USBD_EP_SET_DBL_TX_CONF(ep, type, tx0_addr, tx1_addr);
}

/**
 * @brief Initialize a double buffer unidirectional OUT endpoint.
 * @param ep Endpoint number.
 * @param type Endpoint type.
 * @param rx0_addr The address offset of the endpoint's OUT 0 buffer inside the Packet Memory Area.
 * @param rx1_addr The address offset of the endpoint's OUT 1 buffer inside the Packet Memory Area.
 * @param rx_count The size of the endpoint's OUT buffer inside the Packet Memory Area.
 * @param ep_out Pointer to callback function that handles the OUT transaction of the endpoint.
 */
void usbd_register_ep_dbl_rx(uint8_t ep, uint32_t type, uint32_t rx0_addr, uint32_t rx1_addr, uint32_t rx_count, void (*ep_out)(void))
{
	ASSERT(ep < 8);
	ASSERT((type == USB_EP_TYPE_BULK) || (type == USB_EP_TYPE_ISOCHRONOUS));
	ASSERT((rx0_addr < PMA_SIZE) && (rx1_addr < PMA_SIZE) && (rx_count < USBD_PMA_COUNT));
	ASSERT(ep_out != NULL);
	ep_handler[ep][0] = ep_out;
	USBD_EP_SET_DBL_RX_CONF(ep, type, rx0_addr, rx1_addr, rx_count);	
}

/**
 * @brief Uninitialize an endpoint.
 * @param ep Endpoint number.
 */
void usbd_unregister_ep(uint8_t ep)
{
	ASSERT(ep < 8);
	ep_handler[ep][1] = NULL;
	ep_handler[ep][0] = NULL;
	USBD_EP_CLEAR_CONF(ep);
}

/**
 * @brief Copy data from a buffer, to a usb sram memory buffer.
 * @param src Pointer to uint8_t buffer, this is the buffer given.
 * @param dst Pointer to volatile uint16_t usb sram memory buffer, the pma address of an enpoint should be used.
 * @param cnt Amount of data to copy from buffer to usb sram buffer.
*/
void usbd_pma_write(uint8_t* src, uint16_t* dst, uint16_t cnt)
{
	uint16_t half_cnt, tmp_val;
	half_cnt = (cnt >> 0x1U);

	/*Copy to packet buffer area.*/
	while (half_cnt--)
	{
		tmp_val = (uint16_t)(*src);
		src++;
		tmp_val |= (((uint16_t)(*src)) << 0x8U);
		*dst = tmp_val;
		dst++;
		src++;
	}

	/*If the size is odd copy the leftover bytes.*/
	if (cnt & 0x1U)
	{
		tmp_val = (uint16_t)(*src);
		*dst = tmp_val;
	}
}

/**
 * @brief Copy data from a usb sram memory buffer, to a buffer.
 * @param src Pointer to volatile uint16_t usb sram memory buffer, the pma address of an enpoint should be used.
 * @param dst Pointer to uint8_t buffer, this is the buffer to copy the data to.
 * @param cnt Amount of data to copy from usb sram buffer to buffer. There is no error checking in this function.
*/
void usbd_pma_read(uint16_t* src, uint8_t* dst, uint16_t cnt)
{
	uint16_t half_cnt, tmp_val;
	half_cnt = (cnt >> 0x1U);

