JamesBara/STM32L4xx_USB_Device/usbd_core/src/usbd_core.c
	/*Copy from packet buffer area.*/
	while (half_cnt--)
	{
		tmp_val = *src;
		*dst = (uint8_t)(tmp_val & 0xFFU);
		dst++;
		*dst = (uint8_t)((tmp_val & 0xFF00U) >> 0x8U);
		src++;
		dst++;
	}

	/*If the size is odd copy the leftover bytes.*/
	if (cnt & 0x1U)
	{
		tmp_val = *src;
		*dst = (uint8_t)(tmp_val & 0xFFU);
	}
}

/**
 * @brief After parsing a setup packet use this function to transmit data over endpoint 0. 
 * @param buf Pointer to uint8_t buffer, that will be used to transmit data.
 * @param cnt Size of buffer.
*/
void usbd_prepare_data_in_stage(uint8_t* buf, uint32_t cnt)
{
	ASSERT(buf != NULL);
	ep0_buf = buf;
	ep0_cnt = cnt;
	stage = usbd_data_in_stage;

	if (ep0_cnt >= EP0_COUNT)
	{

		USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_STALL);
	}
	else
	{
		USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_NAK);
	}
	USBD_PMA_SET_TX_COUNT(EP0, MIN(EP0_COUNT, ep0_cnt));
	usbd_pma_write(ep0_buf, ADDR0_TX, MIN(EP0_COUNT, ep0_cnt));
	USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_VALID);
}

/**
 * @brief After parsing a setup packet use this function to receive data over endpoint 0.
 * @param buf Pointer to uint8_t buffer, that will be used to store the data.
 * @param cnt Size of buffer.
 * @param rx_cplt Pointer to function that will be called once the data reception has been completed.
*/
void usbd_prepare_data_out_stage(uint8_t* buf, uint32_t cnt, void (*rx_cplt)(void))
{
	ASSERT(buf != NULL);
	ASSERT(cnt);
	ep0_buf = buf;
	ep0_cnt = cnt;
	stage = usbd_data_out_stage;
	/*Store the pointer to the callback*/
	if (rx_cplt != NULL)
	{
		reception_completed = rx_cplt;
	}
	/*Prepare the other direction*/
	if (ep0_cnt > EP0_COUNT)
	{
		USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_STALL);
	}
	else
	{
		USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_NAK);
	}

	USBD_EP_SET_STAT_RX(EP0, USB_EP_STAT_RX_VALID);
}

/**
 * @brief After parsing a setup packet use this function to acknowledge that the transaction is complete,
 * without need for further data transmission or reception. In simple english send a zlp.
*/
void usbd_prepare_status_in_stage(void)
{
	stage = usbd_status_in_stage;
	USBD_PMA_SET_TX_COUNT(EP0, 0);
	USBD_EP_SET_STAT_TX(EP0, USB_EP_STAT_TX_VALID);
}

void usbd_core_init(usbd_core_config_type *conf)
{
	ASSERT(conf != NULL);
	config = conf;
	cur_state = &default_state;

	/*Prepare the hardware.*/
	__IO uint16_t *reg = (uint16_t*)PMA_BASE;
	CLEAR(USB->CNTR, USB_CNTR_PDWN);

	/*1 microsecond delay is needed for stm32l412 according to the datasheet.*/
	__cpu_busy_wait(1);

	USB->BTABLE = 0;

	/*Clear the SRAM.*/
	for (uint16_t i = 0; i < (PMA_SIZE >> 0x1U); i++)
	{
		*reg++ = 0x0U;
	}
	/*Remove force reset.*/
	CLEAR(USB->CNTR, USB_CNTR_FRES);
	/*Enable interrupts.*/
	SET(USB->CNTR, (USB_CNTR_CTRM | USB_CNTR_RESETM | USB_CNTR_SUSPM | USB_CNTR_WAKEUPM | USB_CNTR_SOFM));
	/*Clear pending interrupts*/
	USB->ISTR = 0x0U;

	/*Enable the usb DP pullup to connect to host.*/
	SET(USB->BCDR, USB_BCDR_DPPU);
}

#if USBD_CORE_EVENT_DRIVEN == 1
void usbd_core_run(void)
{
	uint32_t primask = __get_PRIMASK();
	__disable_irq();
	__ISB();
	__DSB();
	enum usbd_event e = usbd_event_dequeue();
	__enable_irq();
	__set_PRIMASK(primask);
	usbd_device_event_handler(e);
}
#endif

/**
 * @brief Implementation of the weak function USB_IRQHandler.
 * @param  
 */
void USB_IRQHandler(void)
{
#if USBD_CORE_EVENT_DRIVEN == 1
	usbd_event_generator();
#else
	usbd_irq_handler();
#endif
}